[
{
    "id": 1,
    "question": "How much importance do you place on work vs leisure?"
  },
  {
    "id": 2,
    "question": "Do you have specific dietary or nutritional attitudes? I.e., Vegan, Health foods etc?"
  },
  {
    "id": 3,
    "question": "What is your stance on recreational marijuana?"
  },
  {
    "id": 4,
    "question": "What is your attitude towards money?"
  },
  {
    "id": 5,
    "question": "Do you find yourself attracted to motivational, self-help books & Ted talks?"
  },
  {
    "id": 6,
    "question": "Do you want an ‘open home’ policy or more private?"
  },
  {
    "id": 7,
    "question": "What is your philosophy for educating your children?"
  },
  {
    "id": 8,
    "question": "What kind of parent do you think you will be?"
  },
  {
    "id": 9,
    "question": "What is your ideal family size?"
  },
  {
    "id": 10,
    "question": "Describe a typical Shabbat in your future home?"
  },
  {
    "id": 11,
    "question": "What role does religion play in your future family life?"
  },
  {
    "id": 12,
    "question": "From your experience in observing parents disciplining children, what method do you respect most? What would you personally adopt as your way of dealing with discipline?"
  },
  {
    "id": 13,
    "question": "How do you define the roles of a husband and wife in a marriage?"
  },
  {
    "id": 14,
    "question": "How would you manage a situation where there are opposing opinions?"
  },
  {
    "id": 15,
    "question": "What is your love language? And why?"
  },
  {
    "id": 16,
    "question": "How do you express your anger when something upsets you?"
  },
  {
    "id": 17,
    "question": "What is your greatest strength that you bring to a marriage?"
  },
  {
    "id": 18,
    "question": "What is the most important value you seek in a spouse? And why?"
  },
  {
    "id": 19,
    "question": "In your opinion, what are the 4 pillars of a successful marriage?"
  },
  {
    "id": 20,
    "question": "What have you learned by observing your married siblings, and/or other married couples?"
  },
  {
    "id": 21,
    "question": "What are 3 things you are most thankful for right now?"
  },
  {
    "id": 22,
    "question": "What is the most valuable lesson you’ve learned in life?"
  },
  {
    "id": 23,
    "question": "Name two of the most positive impacts your parents had on your life that you will take into your future."
  },
  {
    "id": 24,
    "question": "What do you envision for your home environment, in terms of secular influences such as video entertainment, cartoons, music, books, friends?"
  },
  {
    "id": 25,
    "question": "How important is it that your spouse values learning Torah/Chassidus?"
  },
  {
    "id": 26,
    "question": "What is one of your dreams/aspirations you wish to achieve in your future?"
  },
  {
    "id": 27,
    "question": "What is a recent achievement you are most proud of?"
  },
  {
    "id": 28,
    "question": "What behaviours/character traits bother you? And why?"
  },
  {
    "id": 29,
    "question": "What do you wish people understood about you?"
  },
  {
    "id": 30,
    "question": "What is a recent challenge you have overcome?"
  },
  {
    "id": 31,
    "question": "What makes you feel connected to G-D?"
  },
  {
    "id": 32,
    "question": "What moves, touches or inspires you?"
  },
  {
    "id": 33,
    "question": "How do you best express yourself? Through face-to-face conversations? Writing? Or another way?"
  },
  {
    "id": 34,
    "question": "What is your coping mechanism when things are stressful?"
  },
  {
    "id": 35,
    "question": "What don’t you have the patience for?"
  },
  {
    "id": 36,
    "question": "What's your idea of a perfect day?"
  },
  {
    "id": 37,
    "question": "What are your passions/hobbies?"
  },
  {
    "id": 38,
    "question": "What are the top 3 things on your bucket list?"
  },
  {
    "id": 39,
    "question": "What's something you'd like to try, but are too scared to?"
  },
  {
    "id": 40,
    "question": "What's the most adventurous thing you have ever done?"
  },
  {
    "id": 41,
    "question": "If you could take a year-long paid sabbatical, what would you do?"
  },
  {
    "id": 42,
    "question": "What's the most embarrassing situation you found yourself in?"
  },
  {
    "id": 43,
    "question": "What's the most exciting thing that happened to you recently?"
  },
  {
    "id": 44,
    "question": "What is your happiest childhood memory?"
  },
  {
    "id": 45,
    "question": "If you won the lottery, what would you do with it?"
  },
  {
    "id": 46,
    "question": "In just a few words, look at the person you are dating and describe them."
  },
  {
    "id": 47,
    "question": "What quirky habit or behaviour about you are you willing to share?"
  },
  {
    "id": 48,
    "question": "What was your first impression of your date?"
  },
  {
    "id": 49,
    "question": "What do you admire most about your date?"
  },
  {
    "id": 50,
    "question": "What would you enjoy doing with your spouse in your free time?"
  },
  {
    "id": 51,
    "question": "What is your pet peeve?"
  },
  {
    "id": 52,
    "question": "What is your favourite meal?"
  },
  {
    "id": 53,
    "question": "What's your favourite book? And why?"
  },
  {
    "id": 54,
    "question": "If you were stuck on an island which 3 things can’t you live without?"
  },
  {
    "id": 55,
    "question": "When you were a kid, what did you want to be when you grew up?"
  },
  {
    "id": 56,
    "question": "What’s the scariest thing you’ve ever done?"
  },
  {
    "id": 57,
    "question": "What’s the best thing about your life right now?"
  },
  {
    "id": 58,
    "question": "What is one thing that you’ve never told anyone else?"
  },
  {
    "id": 59,
    "question": "Who are you closest to in your family?"
  },
  {
    "id": 60,
    "question": "When did something extraordinarily special happen to you?"
  },
  {
    "id": 61,
    "question": "Share a divine providence story that was clearly the hand of G-d."
  },
  {
    "id": 62,
    "question": "Did you ever make up an original invention to make life easier, what was it?"
  },
  {
    "id": 63,
    "question": "If you had to teach a profound lesson to little kids in a classroom, what would it be?"
  },
  {
    "id": 64,
    "question": "If you had extra hours in your day, how would you use them?"
  },
  {
    "id": 65,
    "question": "What was the greatest constructive consequence you received as a kid?"
  },
  {
    "id": 66,
    "question": "Tell 2 truths and one lie, let me guess which one is the lie."
  },
  {
    "id": 67,
    "question": "If you had a chance to change just one thing in this world, what would you choose?"
  },
  {
    "id": 68,
    "question": "How do you think social media changed the world today?"
  },
  {
    "id": 69,
    "question": "Is there someone you miss the most, and why?"
  },
  {
    "id": 70,
    "question": "What kind of business would you open if you could?"
  },
  {
    "id": 71,
    "question": "What 3 words best describe your personality?"
  },
  {
    "id": 72,
    "question": "What skill would you love to learn if you had the time and money?"
  },
  {
    "id": 73,
    "question": "Which one describes you more, an introvert or extrovert?"
  },
  {
    "id": 74,
    "question": "What does success look like to you?"
  },
  {
    "id": 75,
    "question": "Name a bad habit you were able to get rid of?"
  },
  {
    "id": 76,
    "question": "Name a bad habit you would love to get rid of?"
  },
  {
    "id": 77,
    "question": "Who were you closer to when growing up, mom or dad?"
  },
  {
    "id": 78,
    "question": "If you could change one thing about your childhood, what would it be?"
  },
  {
    "id": 79,
    "question": "What was your biggest failure?"
  },
  {
    "id": 80,
    "question": "What would you want said about you at your eulogy?"
  },
  {
    "id": 81,
    "question": "Have you ever not forgiven someone and why?"
  },
  {
    "id": 82,
    "question": "How can I help you feel more appreciated? What can I do for you?"
  },
  {
    "id": 83,
    "question": "What’s the best gift I can give you?"
  },
  {
    "id": 84,
    "question": "What qualities do you think attribute to a successful marriage?"
  },
  {
    "id": 85,
    "question": "Is there a couple you admire that you look up to? Describe what you admire."
  },
  {
    "id": 86,
    "question": "What do you think is the biggest challenge couples face today?"
  },
  {
    "id": 87,
    "question": "What do you find attractive in me?"
  },
  {
    "id": 88,
    "question": "If you can have any superpower, what would it be and why?"
  },
  {
    "id": 89,
    "question": "What’s one thing you cherish most about your family?"
  },
  {
    "id": 90,
    "question": "How do you define happiness for yourself?"
  },
  {
    "id": 91,
    "question": "How do you make friends?"
  },
  {
    "id": 92,
    "question": "What do you think your family can improve on?"
  },
  {
    "id": 93,
    "question": "Who inspires you the most?"
  },
  {
    "id": 94,
    "question": "Share your latest most inspiring story you’ve heard."
  },
  {
    "id": 95,
    "question": "Who has been the most supportive person in your life?"
  },
  {
    "id": 96,
    "question": "What’s something you can teach me about?"
  },
  {
    "id": 97,
    "question": "What is your most valuable skill?"
  },
  {
    "id": 98,
    "question": "What is the best bad decision you have ever made?"
  },
  {
    "id": 99,
    "question": "What's the most thoughtful gift you ever received?"
  },
  {
    "id": 100,
    "question": "Would you rather go hiking and camping outdoors? Or relax on a beach resort?"
  },
  {
    "id": 101,
    "question": "If you were guaranteed the correct answer to one question, what would you ask?"
  },
  {
    "id": 102,
    "question": "If you had to live one week without the internet and a cell phone, what would you do to keep busy?"
  },
  {
    "id": 103,
    "question": "What is your happy place?"
  },
  {
    "id": 104,
    "question": "What’s the craziest thing you would do for $10,000?"
  },
  {
    "id": 105,
    "question": "How do you calm yourself when you get angry?"
  },
  {
    "id": 106,
    "question": "What's the biggest change you want to see happen in your life?"
  },
  {
    "id": 107,
    "question": "What do you think is the best feeling in the world?"
  },
  {
    "id": 108,
    "question": "What is your best piece of advice to everyone?"
  },
  {
    "id": 109,
    "question": "What is one beautiful thing you see every single day?"
  },
  {
    "id": 110,
    "question": "What was the single best realization you ever had?"
  },
  {
    "id": 111,
    "question": "Is a wrong act ok if nobody ever knows about it?"
  },
  {
    "id": 112,
    "question": "Have you ever made a decision that changed your whole life? What was it?"
  },
  {
    "id": 113,
    "question": "What do you refuse to spend money on?"
  },
  {
    "id": 114,
    "question": "What would you do if you can be invisible for one day?"
  },
  {
    "id": 115,
    "question": "Ideally, how would you like to spend your birthday?"
  },
  {
    "id": 116,
    "question": "What’s the one thing that people don’t know about you, just by looking at you?"
  },
  {
    "id": 117,
    "question": "What did you think you could never accomplish, but actually did, what was it like?"
  },
  {
    "id": 118,
    "question": "What qualities attract you to a person when you first meet them?"
  },
  {
    "id": 119,
    "question": "Who was your best teacher and why were they the best?"
  },
  {
    "id": 120,
    "question": "What is the most expensive thing you have ever bought?"
  },
  {
    "id": 121,
    "question": "What is the most impulsive thing you have ever done yet?"
  },
  {
    "id": 122,
    "question": "Would you rather vacation with your family or friends?"
  },
  {
    "id": 123,
    "question": "What’s your favourite homemade cooked meal?"
  },
  {
    "id": 124,
    "question": "Do you volunteer, do any outreach?"
  },
  {
    "id": 125,
    "question": "How often do you call your parents?"
  },
  {
    "id": 126,
    "question": "What special thing does your family do, that is unique?"
  },
  {
    "id": 127,
    "question": "How did your parents meet?"
  },
  {
    "id": 128,
    "question": "What core values did your parents instil in you?"
  },
  {
    "id": 129,
    "question": "What is an example of a toxic personality trait?"
  },
  {
    "id": 130,
    "question": "What material things can’t you live without?"
  },
  {
    "id": 131,
    "question": "When’s the last time you did a good deed for someone without them asking?"
  },
  {
    "id": 132,
    "question": "What makes you feel empowered?"
  },
  {
    "id": 133,
    "question": "Who are your role models?"
  },
  {
    "id": 134,
    "question": "When do you feel most accomplished?"
  },
  {
    "id": 135,
    "question": "Do you lead or follow?"
  },
  {
    "id": 136,
    "question": "What is your biggest regret in life?"
  },
  {
    "id": 137,
    "question": "What makes you feel alive?"
  },
  {
    "id": 138,
    "question": "What emotion do you experience most in life?"
  },
  {
    "id": 139,
    "question": "When did you last feel vulnerable?"
  },
  {
    "id": 140,
    "question": "What was the worst phase of your life?"
  },
  {
    "id": 141,
    "question": "When have you felt the biggest adrenaline rush?"
  },
  {
    "id": 142,
    "question": "What do you miss most about being a kid?"
  },
  {
    "id": 143,
    "question": "When is it ok to break the law?"
  },
  {
    "id": 144,
    "question": "When was the last time you pushed yourself to your limits?"
  },
  {
    "id": 145,
    "question": "How do you contribute to society?"
  },
  {
    "id": 146,
    "question": "If you can make just one positive impact on the world what would that be?"
  },
  {
    "id": 147,
    "question": "Is it more important to help yourself? Your family? Society? Or the world?"
  },
  {
    "id": 148,
    "question": "What do you wish your parents understood about you?"
  },
  {
    "id": 149,
    "question": "What is your dream job?"
  },
  {
    "id": 150,
    "question": "What inspires you to get out of bed every morning?"
  },
  {
    "id": 151,
    "question": "What cause are you extremely passionate about and why?"
  },
  {
    "id": 152,
    "question": "What great lesson did you learn the hard way?"
  },
  {
    "id": 153,
    "question": "What's the nicest thing anyone has done for you ever, and why?"
  },
  {
    "id": 154,
    "question": "Which do you value more, intelligence or kindness, why?"
  },
  {
    "id": 155,
    "question": "Do you believe people are capable of changing, why or why not?"
  },
  {
    "id": 156,
    "question": "Whose death impacted you most and why?"
  },
  {
    "id": 157,
    "question": "Do you hold grudges, or forgive easily?"
  },
  {
    "id": 158,
    "question": "What is the most rewarding project you have ever worked on?"
  },
  {
    "id": 159,
    "question": "What do you do to unwind at the end of a day?"
  },
  {
    "id": 160,
    "question": "What would the book about your life be called?"
  },
  {
    "id": 161,
    "question": "What crazy thing do you want to try one day?"
  },
  {
    "id": 162,
    "question": "What do you wish someone taught you, a long time ago?"
  },
  {
    "id": 163,
    "question": "What topic can you give a 30 minute presentation about without preparing?"
  },
  {
    "id": 164,
    "question": "Who would be the worst person to be stuck with in an elevator?"
  },
  {
    "id": 165,
    "question": "What skill should people take more time to learn?"
  },
  {
    "id": 166,
    "question": "Have you ever felt out of place somewhere? What happened?"
  },
  {
    "id": 167,
    "question": "What is the worst purchase you have ever made?"
  },
  {
    "id": 168,
    "question": "What is the worst place you have ever been stuck in for a long time?"
  },
  {
    "id": 169,
    "question": "What isn't real but you wish were real?"
  },
  {
    "id": 170,
    "question": "What do you love to do with your friends for fun?"
  },
  {
    "id": 171,
    "question": "What is your favourite indoor activity?"
  },
  {
    "id": 172,
    "question": "If you were to break a world record, what would it be?"
  },
  {
    "id": 173,
    "question": "What is your secret hidden talent?"
  },
  {
    "id": 174,
    "question": "What do you take for granted?"
  },
  {
    "id": 175,
    "question": "What’s your favourite joke?"
  },
  {
    "id": 176,
    "question": "If you could rewrite your past, what’s one thing you’d change?"
  },
  {
    "id": 177,
    "question": "If you could only eat one food for the rest of your life, what would it be?"
  },
  {
    "id": 178,
    "question": "What’s the best part about your job?"
  },
  {
    "id": 179,
    "question": "If tomorrow were your last day on earth, what would you do?"
  },
  {
    "id": 180,
    "question": "Where’s the coolest place you’ve ever been?"
  },
  {
    "id": 181,
    "question": "How would others describe you?"
  },
  {
    "id": 182,
    "question": "If you could live anywhere in the world, where would you live and why?"
  },
  {
    "id": 183,
    "question": "What can always put you in a good mood?"
  },
  {
    "id": 184,
    "question": "What’s your guilty pleasure snack, drink, or junk food?"
  },
  {
    "id": 185,
    "question": "What’s one thing you wish you could change about yourself?"
  },
  {
    "id": 186,
    "question": "What’s your favourite quote, line of poetry, or sentence?"
  },
  {
    "id": 187,
    "question": "What’s one thing you’ve learned about yourself from a past relationship?"
  },
  {
    "id": 188,
    "question": "What’s the scariest thing that ever happened to you as a kid?"
  },
  {
    "id": 189,
    "question": "How would you describe your parents?"
  },
  {
    "id": 190,
    "question": "What are your thoughts about death?"
  },
  {
    "id": 191,
    "question": "What’s your strongest and weakest character trait?"
  },
  {
    "id": 192,
    "question": "What’s the worst job you’ve ever had?"
  },
  {
    "id": 193,
    "question": "What are you still sad about?"
  },
  {
    "id": 194,
    "question": "What’s the best advice someone has ever given to you?"
  },
  {
    "id": 195,
    "question": "What would you tell your teenage self?"
  },
  {
    "id": 196,
    "question": "Do you believe in miracles; describe a miracle you have personally witnessed?"
  },
  {
    "id": 197,
    "question": "Are you fond of who you are?"
  },
  {
    "id": 198,
    "question": "Are you a morning person or night person?"
  },
  {
    "id": 199,
    "question": "Do you prefer making plans or following along with what someone else planned?"
  },
  {
    "id": 200,
    "question": "Do you have a mentor in life that you’ve continuously looked up to?"
  }
]